{
    "name": "SAI NIHAR REDDY PALEM",
    "contact": {
      "email": "sainiharreddy.palem@sjsu.edu",
      "phone": "(562)-822-7482",
      "location": "San Jose, CA",
      "links": {
        "GitHub": "GitHub",
        "LinkedIn": "LinkedIn",
        "Medium": "Medium",
        "Portfolio": "Portfolio"
      }
    },
    "education": [
      {
        "institution": "San Jose State University, California, USA",
        "degree": "Master of Science, Data Analytics",
        "duration": "Jan 2023 – Dec 2024",
        "relevant_coursework": [
          "Machine Learning",
          "Deep Learning",
          "Big Data Analytics",
          "Mathematics for Data Analysis", "Data Mining","Data engineering"
        ]
      },
      {
        "institution": "Sreenidhi Institute of Science and Technology, Hyderabad, India",
        "degree": "Bachelor of Technology, Electrical and Electronics Engineering (EEE)",
        "duration": "June 2015 – June 2019"
      }
    ],
    "technical_skills": {
      "Programming Languages": ["Python", "SQL (Advanced)"],
      "Machine Learning and AI": [
        "PyTorch",
        "TensorFlow",
        "Scikit-Learn",
        "Vision Transformers",
        "Sentence Transformers",
        "LLMs (GPT, LLaMA)"
      ],
      "Data Engineering": [
        "Apache Spark",
        "Apache Airflow",
        "Docker",
        "ETL/ELT Pipelines",
        "CRISP-DM methodology"
      ],
      "Cloud Computing and Big Data": [
        "AWS (Certified)",
        "GCP (BigQuery, Cloud Composer, Cloud Storage)",
        "Snowflake",
        "AWS Redshift",
        "BigQuery"
      ],
      "Data Modeling and Schema Design": [
        "OLAP",
        "Star Schema",
        "Snowflake Schema",
        "Data Normalization"
      ],
      "Data Visualization": [
        "Tableau",
        "PowerBI",
        "Seaborn",
        "Matplotlib",
        "Plotly",
        "Streamlit"
      ],
      "Databases": ["MySQL", "MongoDB", "Snowflake", "BigQuery"]
    },
    "professional_experience": [
      {
        "company": "San Jose State University, San Jose",
        "role": "Instructional Student Assistant",
        "duration": "Aug 2024 – Dec 2024",
        "responsibilities": [
          "Mentored 80+ graduate students on data modeling projects, providing comprehensive feedback on technical documentation and project implementations.",
          "Reviewed and debugged student data pipelines, offering solutions for complex technical challenges in data analysis and ML model optimization."
        ]
      },
      {
        "company": "Bharat Electronics Limited, Hyderabad",
        "role": "Data Analyst",
        "duration": "Feb 2021 – Mar 2022",
        "responsibilities": [
          "Optimized SQL queries for multi-million row defense databases, improving analysis efficiency by 40% across Navy, Air Force, and international defense project analytics.",
          "Developed and maintained 100+ Power BI dashboards tracking defense electronics sales, production costs, and project metrics, enabling data-driven decisions for senior management.",
          "Implemented data standardization protocols using SQL triggers, ensuring consistency in currency conversions and text formatting."
        ]
      }
    ],
    "projects": [
      {
        "name": "Multi-Agent Job Search System Application",
        "duration": "Jan 2025",
        "description": [
          "Engineered dual-agent platform using LLaMA models (8B for parameter extraction and resume summarization, 70B for matching), implementing real-time web scraping across LinkedIn, Glassdoor, and Indeed with automated batch processing of 60+ jobs per search.",
          "Developed intelligent matching system with resume summarization and job compatibility scoring, achieving 70% reduction in search time through optimized prompt engineering and structured data processing."
        ]
      },
      {
        "name": "Resume Easz Application",
        "duration": "Dec 2024 - Jan 2025",
        "description": [
          "Developed AI-powered resume analysis platform using LLaMA 70B model to generate comprehensive analysis reports comparing resumes against job descriptions.",
          "Implemented automated resume generation system with customizable templates, reducing resume creation time by 50% while processing 500+ resumes."
        ]
      },
      {
        "name": "Job Easz Data Collector Application",
        "duration": "Dec 2024",
        "description": [
          "Developed an automated data collection pipeline using Apache Airflow, scraping 10000+ job postings daily from LinkedIn, Glassdoor, Indeed, and Google Jobs.",
          "Created an interactive dashboard featuring time series analysis of job postings and role-based trends, with search and filter functionalities.",
          "Enabled users to access and analyze job market data through an open-source application, promoting data-driven decision making in career planning."
        ]
      },
      {
        "name": "Sign Language Assistant Application",
        "duration": "Aug 2024 - Oct 2024",
        "description": [
          "Built real-time ASL translation system using Google’s Mediapipe Model and Random Forest classifier with optimized gesture recognition.",
          "Achieved 95% accuracy for 19 alphabets while implementing interactive learning features with immediate feedback mechanisms."
        ]
      },
      {
        "name": "National Infrastructure Monitoring Application",
        "duration": "Jan 2024 - Dec 2024",
        "description": [
          "Developed Vision Transformer-based satellite imagery analysis system processing 40GB dataset with custom CV models for infrastructure monitoring.",
          "Achieved 85% accuracy in change detection and deployed interactive temporal analysis interface on Hugging Face Spaces."
        ]
      },
      {
        "name": "Stock Market Chatbot",
        "duration": "Aug 2023 - Dec 2023",
        "description": [
          "Created bilingual financial analysis chatbot integrating GPT-3.5 with yfinance API for real-time market insights and personalized recommendations.",
          "Engineered high-performance backend using Apache Spark and Snowflake, achieving 30% query optimization with sub-5 second response time."
        ]
      },
      {
        "name": "Twitter Trend Analysis with BigQuery",
        "duration": "Jan 2023 - Apr 2023",
        "description": [
          "Engineered GCP-based data pipeline using Cloud Composer and BigQuery, implementing OLAP analytics with Star Schema for processing 10k daily tweets.",
          "Developed automated ETL workflows with custom Python operators for data transformation, achieving 40% improvement in processing efficiency."
        ]
      },
        {
            "name": "Yelp recommendation system",
            "duration": "Jan 2024 - Apr 2024",
            "description": [
            
                "Developed a comprehensive recommendation system for Yelp using advanced data mining techniques, including content-based, collaborative filtering, and hybrid models. The system processed a large dataset of user reviews, business attributes, and interaction logs from the Illinois region, focusing on users with at least three interactions to enhance reliability.",
                "Implemented clustering approaches in both content-based and collaborative filtering models, resulting in significant performance improvements. The clustering-based collaborative filtering model achieved the highest Recall@10 of 0.1271 and Precision@10 of 0.0332, outperforming non-clustering methods and demonstrating enhanced ability to capture relevant recommendations."
            ]
        }
    ],
    "certifications": [
      {
        "name": "AWS Certified Cloud Practitioner",
        "details": "Validated knowledge of AWS services, security, and architectural principles",
        "date": "Jan 2024"
      }
    ],
    "achievements": [
      "Automated multiple data workflows, reducing operational effort by up to 60%.",
      "Led and managed diverse teams across high-impact projects, delivering measurable outcomes."
    ]
  }
  